#Задача_4_2_Вакулина#
import math
a = float(input("Введите переменную (угол в численных единицах): "))
z2 = float(2 * math.sin(a))
print ("Вычисленное z2 =", z2)
